*======================================================================*
*   Программа      :  Печатная форма                                   *
*   Отчет Кадровый резерв                                              *
*                                                                      *
* ---------------------------------------------------------------------*
*   Код разработки :  ZHR_PA_D040                                      *
*----------------------------------------------------------------------*
*   Автор          : Поиленков М.                                      *
*   Постановщик    : Малышева Н.                                       *
*   Дата создания  : 29.08.2017                                        *
*----------------------------------------------------------------------*
*   Назначение     :
*======================================================================*
* версия |  постановка   | разработчик  | дата изменения | комментарий *
*   1      ZHR_PA_D040     Поиленков М.    29.08.2017        создание  *
*----------------------------------------------------------------------*



INCLUDE ZHR_PA_D040_TOP.
INCLUDE ZHR_PA_D040_SSCR.
INCLUDE ZHR_PA_D040_CLS.

INITIALIZATION.
DATA(l_lcl) = new lcl( ).
AT SELECTION-SCREEN ON VALUE-REQUEST FOR p_orgeh-low.
  l_lcl->f4_orgeh( CHANGING p_value = p_orgeh-low ).
START-OF-SELECTION.

    l_lcl->get_peras( ).

END-OF-SELECTION.
  CHECK l_lcl IS BOUND.
 if not p_xml eq 'X'.
    l_lcl->print( ).
else.
  l_lcl->export( ).
endif.
